dimajolkin/tinygo/sdkconfig.defaults
# ESP32-S3 specific configuration
CONFIG_IDF_TARGET="esp32s3"

# Enable minimal app descriptor for debugging
CONFIG_APP_PROJECT_VER_FROM_CONFIG=y
CONFIG_APP_PROJECT_VER="1.0.0"

# Set minimal chip revision to 0 for compatibility
CONFIG_ESP32S3_REV_MIN_0=y
CONFIG_ESP_REV_MIN_FULL=0

# Set minimal efuse block revision to 0 for compatibility
CONFIG_ESP_EFUSE_BLOCK_REV_MIN_FULL=0
